Revit 2027 API
TextNode.FontHeight Property
 Height [ft] of the text font, in model space.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double FontHeight { get; }
Public ReadOnly Property FontHeight As Double
	Get
public:
property double FontHeight {
	double get ();
}
member FontHeight : float with get
Property Value
Double
Remarks
 This is the height of the 'M' glyph in the text font.
See Also
Reference
TextNode Class
Autodesk.Revit.DB Namespace